ams/src/DataProcessors/AMS_ПодборТоваров/AMS_ПодборТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ПодборТоваров</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныДокумент</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныСоглашение</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеПрайса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПродукции</name>
      <type>
        <types>CatalogRef.AMS_Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокКлиента</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокНаш</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидкиАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродукции</name>
      <type>
        <types>CatalogRef.AMS_Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварКлиента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Факт1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагСкидка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагСкидкаАкция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДокумент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоглашение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/Catalogs/AMS_Продукция/AMS_Продукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Продукция</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Маркер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧестныйЗнак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КфцРРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/AMS_ПодборТоваров/Forms/ФормаЗагрузкиИзВнешнегоФайла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Партнер = Параметры.Партнер;
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Родитель");
	Партнер = ?(ЗначениеЗаполнено(Родитель), Родитель, Партнер);
	
	ИмяИБ           = "АМС";
	ИмяНаименования = "Артикул";
	ИмяКоличество   = "Упаковка"; 

	ИнициализироватьТабличныйДокумент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	
	Стр.КоличествоУпаковок = Стр.Количество / Кфц;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	
	Стр.Количество = Стр.КоличествоУпаковок * Кфц;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	ДанныеЗаполнены = ЗначениеЗаполнено(ТабДок.Область("R2C1").Текст);

	Если Не ДанныеЗаполнены Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	
	Табл = ЗаполнитьЗагруженныйТовар();
	
	Штука = (ИмяКоличество = "Штука");
	
	Если ИмяИБ = "АМС" И ИмяНаименования = "Артикул" Тогда
		СопоставитьДанныеПоАртикул(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "АМС" И ИмяНаименования = "Код" Тогда
		СопоставитьДанныеПоКод(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "АМС" И ИмяНаименования = "Номенклатура" Тогда
		СопоставитьДанныеПоНоменклатура(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "АМС" И ИмяНаименования = "Штрихкод" Тогда
		СопоставитьДанныеПоШтрихкод(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "Клиента" И ИмяНаименования = "Артикул" Тогда
		СопоставитьДанныеПоАртикулКлиента(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "Клиента" И ИмяНаименования = "Код" Тогда
		СопоставитьДанныеПоКодКлиента(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "Клиента" И ИмяНаименования = "Номенклатура" Тогда
		СопоставитьДанныеПоНоменклатураКлиента(Табл, Штука);
		
	ИначеЕсли ИмяИБ = "Клиента" И ИмяНаименования = "Штрихкод" Тогда
		СопоставитьДанныеПоШтрихкодКлиента(Табл, Штука);
	КонецЕсли;	

	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
	ОчиститьСообщения(); 
	
	МассивСтрок = ПолучитьНайденныеТовары();
	
	Если Не МассивСтрок = Неопределено Тогда
		Закрыть(МассивСтрок);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	Макет = Обработки.AMS_ПодборТоваров.ПолучитьМакет("МакетЗагрузкиДанных");
	
	Обл = Макет.ПолучитьОбласть("Колонка1");
	ТабДок.Присоединить(Обл); 
	Обл = Макет.ПолучитьОбласть("Колонка2");
	ТабДок.Присоединить(Обл); 

	ТабДок.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗагруженныйТовар()
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Колонка1", Новый ОписаниеТипов("Строка"));
	Табл.Колонки.Добавить("Колонка2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
	
	ВысотаШапки = 1;
	НомерСтроки = ВысотаШапки + 1;
 	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");

	ДанныеЗаполнены = ЗначениеЗаполнено(ТабДок.Область("R" + СтроковыйНомер + "C1").Текст);

	Пока ДанныеЗаполнены Цикл
		НовСтр = Табл.Добавить();
		
		Попытка
			НовСтр.Колонка1 = СокрЛП(ТабДок.Область("R" + СтроковыйНомер + "C1").Текст);
			
			ТекстКолонка2 = СокрЛП(ТабДок.Область("R" + СтроковыйНомер + "C2").Текст);
			Если ПустаяСтрока(ТекстКолонка2) Тогда 
				НовСтр.Колонка2 = 0;
			Иначе
				НовСтр.Колонка2 = Число(ТекстКолонка2);
			КонецЕсли;
		Исключение
			//@skip-check bsl-legacy-check-static-feature-access
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Попытка
			ДанныеЗаполнены = ЗначениеЗаполнено(ТабДок.Область("R" + СтроковыйНомер + "C1").Текст);
		Исключение
			//@skip-check bsl-legacy-check-static-feature-access
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	Возврат Табл;
КонецФункции

&НаСервере
Процедура СопоставитьДанныеПоАртикул(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	Прод.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * Ном.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / Ном.КоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК Прод
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО Прод.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = Прод.Номенклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.НаименованиеНоменклатуры КАК НоменклатураКлиента
	|ПОМЕСТИТЬ НомКонт
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|		ПО (&Партнер = НомКонтр.Владелец)
	|			И вт.Номенклатура = НомКонтр.Номенклатура
	|ГДЕ
	|	НЕ НомКонтр.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НомКонт.КодКлиента КАК КодКлиента,
	|	НомКонт.АртикулКлиента КАК АртикулКлиента,
	|	НомКонт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКонт КАК НомКонт
	|		ПО вт.Номенклатура = НомКонт.Номенклатура";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоКод(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	Прод.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * Ном.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / Ном.КоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК Прод
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО Прод.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = Прод.Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.НаименованиеНоменклатуры КАК НоменклатураКлиента
	|ПОМЕСТИТЬ НомКонт
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|		ПО (&Партнер = НомКонтр.Владелец)
	|			И вт.Номенклатура = НомКонтр.Номенклатура
	|ГДЕ
	|	НЕ НомКонтр.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НомКонт.КодКлиента КАК КодКлиента,
	|	НомКонт.АртикулКлиента КАК АртикулКлиента,
	|	НомКонт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКонт КАК НомКонт
	|		ПО вт.Номенклатура = НомКонт.Номенклатура";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоНоменклатура(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	Прод.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * Ном.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / Ном.КоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК Прод
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО Прод.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = Прод.Номенклатура.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.НаименованиеНоменклатуры КАК НоменклатураКлиента
	|ПОМЕСТИТЬ НомКонт
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|		ПО (&Партнер = НомКонтр.Владелец)
	|			И вт.Номенклатура = НомКонтр.Номенклатура
	|ГДЕ
	|	НЕ НомКонтр.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НомКонт.КодКлиента КАК КодКлиента,
	|	НомКонт.АртикулКлиента КАК АртикулКлиента,
	|	НомКонт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКонт КАК НомКонт
	|		ПО вт.Номенклатура = НомКонт.Номенклатура";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоШтрихкод(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	Штр.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * Ном.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / Ном.КоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО Штр.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = Штр.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.Номенклатура КАК НоменклатураКлиента
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|		ПО (&Партнер = НомКонтр.Владелец)
	|			И вт.Номенклатура = НомКонтр.Номенклатура
	|ГДЕ
	|	НЕ НомКонтр.Недействителен";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоАртикулКлиента(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	НомКонтр.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.Наименование КАК НоменклатураКлиента,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО НомКонтр.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = НомКонтр.Артикул
	|ГДЕ
	|	НомКонтр.Владелец = &Партнер
	|	И НЕ НомКонтр.Недействителен
	|	И НомКонтр.Номенклатура В
	|			(ВЫБРАТЬ
	|				т.Номенклатура КАК Номенклатура
	|			ИЗ
	|				Справочник.AMS_Продукция.Товары КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * вт.Кфц
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / вт.Кфц
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	вт.КодКлиента КАК КодКлиента,
	|	вт.АртикулКлиента КАК АртикулКлиента,
	|	вт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО Тов.ЗагружаемыйТовар = вт.ЗагружаемыйТовар";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоКодКлиента(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	НомКонтр.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.Наименование КАК НоменклатураКлиента,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО НомКонтр.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = НомКонтр.КодНоменклатуры
	|ГДЕ
	|	НомКонтр.Владелец = &Партнер
	|	И НЕ НомКонтр.Недействителен
	|	И НомКонтр.Номенклатура В
	|			(ВЫБРАТЬ
	|				т.Номенклатура КАК Номенклатура
	|			ИЗ
	|				Справочник.AMS_Продукция.Товары КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * вт.Кфц
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / вт.Кфц
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	вт.КодКлиента КАК КодКлиента,
	|	вт.АртикулКлиента КАК АртикулКлиента,
	|	вт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО Тов.ЗагружаемыйТовар = вт.ЗагружаемыйТовар";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоНоменклатураКлиента(Табл, Штука)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	НомКонтр.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.Наименование КАК НоменклатураКлиента,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО НомКонтр.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = НомКонтр.НаименованиеНоменклатуры
	|ГДЕ
	|	НомКонтр.Владелец = &Партнер
	|	И НЕ НомКонтр.Недействителен
	|	И НомКонтр.Номенклатура В
	|			(ВЫБРАТЬ
	|				т.Номенклатура КАК Номенклатура
	|			ИЗ
	|				Справочник.AMS_Продукция.Товары КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * вт.Кфц
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / вт.Кфц
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	вт.КодКлиента КАК КодКлиента,
	|	вт.АртикулКлиента КАК АртикулКлиента,
	|	вт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО Тов.ЗагружаемыйТовар = вт.ЗагружаемыйТовар";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеПоШтрихкодКлиента(Табл, Штука)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Табл);
	Запрос.УстановитьПараметр("Штука", Штука);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.Колонка1 КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Колонка2 КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	НомКонтр.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.Наименование КАК НоменклатураКлиента,
	|	Ном.КоэффициентЕдиницыДляОтчетов КАК Кфц
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО НомКонтр.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = НомКонтр.Штрихкод
	|ГДЕ
	|	НомКонтр.Владелец = &Партнер
	|	И НЕ НомКонтр.Недействителен
	|	И НомКонтр.Номенклатура В
	|			(ВЫБРАТЬ
	|				т.Номенклатура КАК Номенклатура
	|			ИЗ
	|				Справочник.AMS_Продукция.Товары КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество
	|		ИНАЧЕ Тов.Количество * вт.Кфц
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &Штука
	|			ТОГДА Тов.Количество / вт.Кфц
	|		ИНАЧЕ Тов.Количество
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	вт.КодКлиента КАК КодКлиента,
	|	вт.АртикулКлиента КАК АртикулКлиента,
	|	вт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО Тов.ЗагружаемыйТовар = вт.ЗагружаемыйТовар";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНайденныеТовары()
	Отказ       = Ложь;
	МассивСтрок = Новый Массив;
	НомерСтроки = 0;
	
	Для каждого Стр Из Товары Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю("По данным для поиска в строке " + НомерСтроки + " совпадений не найдено.",,,,Отказ);
		КонецЕсли;
			
		Если Стр.Количество = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке " + НомерСтроки + " не указано количество.",,,,Отказ);
		КонецЕсли; 
		
		Если Стр.КоличествоУпаковок - Цел(Стр.КоличествоУпаковок) > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке " + НомерСтроки + " не указано не целое количество упаковок.",,,,Отказ);
		КонецЕсли; 

		НовСтр = Новый Структура("Номенклатура, Количество");
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;
		
		МассивСтрок.Добавить(НовСтр);
	КонецЦикла; 

	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивСтрок;
	КонецЕсли;
КонецФункции

#КонецОбласти
